tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Shell
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'shellcheck'
brew 'pre-commit'

# Languages
brew 'go'
brew 'openjdk'
brew 'python'
brew 'ruby'
brew 'rust'

# Dev Tools
brew 'git'
brew 'git-lfs'
brew 'nvm'
brew 'yarn', args: ['ignore-dependencies']
brew 'hadolint'
brew 'httpie'
cask 'docker'
brew 'dive'
brew 'kubernetes-cli'
brew 'minikube'
brew 'helm'
brew 'circleci'
brew 'gh'

# Browsers
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'microsoft-edge'

# Dev Apps
cask 'font-jetbrains-mono'
cask 'visual-studio-code'
cask 'github'
cask 'hyper-canary'

# QuickLook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'webpquicklook'

# Chat
cask 'slack'
cask 'zoom'

# Essential Apps
cask 'logitech-options'
cask 'spectacle'
cask 'stats'
cask 'the-unarchiver'
cask 'vlc'
