# Shell
brew 'shellcheck'
brew 'pre-commit'

# Dev Tools
brew 'circleci'
brew 'dive'
brew 'gh'
brew 'git-lfs'
brew 'git'
brew 'hadolint'
brew 'helm'
brew 'httpie'
brew 'kubernetes-cli'
brew 'minikube'
brew 'nvm'
brew 'yarn', args: ['ignore-dependencies']
cask 'docker'

# Browsers
cask 'firefox'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'microsoft-edge'

# Dev Apps
cask 'font-jetbrains-mono'
cask 'github'
cask 'hyper-canary'
cask 'visual-studio-code'

# QuickLook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# Chat
cask 'slack'
cask 'zoom'
