tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Shell
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'shellcheck'
brew 'pre-commit'

# Languages
brew 'go'
cask 'java'
brew 'python'
brew 'ruby'

# Dev Tools
brew 'git'
brew 'git-lfs'
brew 'nvm'
brew 'yarn', args: ['ignore-dependencies']
brew 'httpie'
cask 'docker'
brew 'kubernetes-cli'
brew 'minikube'
brew 'helm'
brew 'circleci'
brew 'gh'

# Browsers
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'microsoft-edge'

# Dev Apps
cask 'font-jetbrains-mono'
cask 'visual-studio-code-insiders'
cask 'github-beta'
cask 'hyper-canary'

# QuickLook plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'webpquicklook'

# Chat
cask 'skype'
cask 'slack-beta'
cask 'discord-canary'
cask 'caprine'
cask 'signal-beta'
cask 'telegram-desktop'
cask 'whatsapp'
cask 'zoomus'

# Essential Apps
cask 'spectacle'
cask 'the-unarchiver'
cask 'vlc'
